app/views/streams/_stream.html.erb

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <td><%= stream.url_type %></td>
    <td><%= Station.find(stream.station_id).name if stream.station_id? %> </td>